@Official-James Thanks for reporting this issue. As you have accurately summarised, this breaking change was reluctantly introduced in order to fix a bug introduced with v2.37.0. Ordinarily this would not have as much of an issue, but in this case, the API has a bug which makes it impossible to unset this field.

Unfortunately, working around this any other way would have created other side effects and simply postponed the problem to a future release where it's likely that more practitioners would be affected. However, there are a couple of options available to you if you are now presented with this unexpected diff.

The first and easiest option would be to allow Terraform to delete and recreate the groups. Assuming that you are using Terraform to manage manual group memberships and other dependencies such as role assignments, this will momentarily break your setup but should restore everything in a desired state after the apply is completed.

The second option, which you may wish to use if recreating the group is going to cause you additional problems (such as hardcoding the uuid elsewhere, or managing the group out of band by other unrecoverable means), is to use the `ignore_changes` lifecycle option to have Terraform ignore this property. For example:

```terraform
terraform {
  required_providers {
    azuread = {
      source  = "hashicorp/azuread"
      version = "2.37.1"
    }
  }
}

resource "azuread_group" "test" {
  display_name     = "aaatest"
  security_enabled = true

  lifecycle {
    ignore_changes = [onpremises_group_type]
  }
}
```

After which, running Terraform apply should suppress the unwanted diff, going from this:

```shell
~/tmp/azuread-issue-1072 12s
❯ terraform apply
azuread_group.test: Refreshing state... [id=b25f6ae7-1087-40ce-b27f-231a5e2f788b]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_group.test must be replaced
-/+ resource "azuread_group" "test" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      ~ auto_subscribe_new_members     = false -> (known after apply)
      - behaviors                      = [] -> null
      ~ external_senders_allowed       = false -> (known after apply)
      ~ hide_from_address_lists        = false -> (known after apply)
      ~ hide_from_outlook_clients      = false -> (known after apply)
      ~ id                             = "b25f6ae7-1087-40ce-b27f-231a5e2f788b" -> (known after apply)
      + mail                           = (known after apply)
      - mail_enabled                   = false -> null
      ~ mail_nickname                  = "108b5dfd-7" -> (known after apply)
      ~ members                        = [] -> (known after apply)
      ~ object_id                      = "b25f6ae7-1087-40ce-b27f-231a5e2f788b" -> (known after apply)
      + onpremises_domain_name         = (known after apply)
      - onpremises_group_type          = "UniversalSecurityGroup" -> null # forces replacement
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      ~ onpremises_sync_enabled        = false -> (known after apply)
      ~ owners                         = [
          - "3aa04c8c-5a75-4e5e-9117-1b7cf6f33e21",
        ] -> (known after apply)
      + preferred_language             = (known after apply)
      - provisioning_options           = [] -> null
      ~ proxy_addresses                = [] -> (known after apply)
      - types                          = [] -> null
      + visibility                     = (known after apply)
        # (4 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value:
```

to this:

```shell
~/tmp/azuread-issue-1072 12s
❯ terraform apply
azuread_group.test: Refreshing state... [id=b25f6ae7-1087-40ce-b27f-231a5e2f788b]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

~/tmp/azuread-issue-1072
❯ 
```

Apologies for the situation this has clearly presented you with, as mentioned alas this was the least worst option available to us, after the original bug was unintentionally introduced in last week's release.